<?php

namespace Database\Seeders;

use App\Models\Blog;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class blogsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $blogs = [
            [
                'title' => 'تعريف العلاج الطبيعي',
                'content' => 'تعريف العلاج الطبيعي:

العلاج الطبيعي هو أحد فروع الطب يقدم خدمات للأفراد من أجل علاج الحالات المرضية بالطرق الطبيعية والفيزيائية ويعمل على تطوير الحركة والحفاظ عليها واعادتها إلى الحد الأقصى والقدرة الوظيفية في جميع مراحل الحياة، ويعمل على إضافة الأمل للحالات العلاجية.

        يشمل أيضا فحص وتقييم الحالة المرضية بالكامل، بالإضافة إلى تقديم الخدمات في الظروف التي تكون فيها الحركة مهددة بسبب الإصابات أو الأمراض أو العوامل البيئية.

وهو مهنة علاجية تتعلق باستخدام أساليب مختلفة لاستعادة توازن المريض النفسي، والجسدي، وتحسينه، والمحافظة عليه، مع الأخذ بالحسبان التغيرات المتنوعة في الحالة الصحية للشخص المعالج حيث يستند العلاج الطبيعي إلى أسس علمية قوية، ويعتمد على الخبرة المهنية، وتحليل حالة المريض.

 

مجالات العلاج الطبيعي:

للعلاج الطبيعي العديد من التخصصات منها طب القلوب، وطب المسنين وطب الأمراض العصبية، وجراحة العظام وطب الأطفال حيث يعمل أطباء العلاج الفيزيائي في العديد من الأماكن، مثل العيادات الخارجية أو المكاتب، ومرافق إعادة التأهيل للمرضى الداخليين، ومرافق الرعاية الممتدة والمنازل الخاصة، والتعليم، والمراكز البحثية والمدارس ودور العجزة، وأماكن العمل الصناعية

أو غيرها من البيئات المهنية.

 

أهداف العلاج الطبيعي:
المحافظة على اللياقة البدنية:

يساعد العلاج الطبيعي في الحفاظ على لياقة جسمية جيدة لذوي الإعاقة.

تحسين وظائف الحركة:

يهدف العلاج الطبيعي إلى تحسين قدرة الشخص على التنقل والحركة بشكل عام، من خلال تقوية العضلات وتحسين المرونة والتوازن، وتقليل الوزن الزائد وتحسين اللياقة العامة.

التقليل من التوتر الألم:

 يسهم العلاج الطبيعي في تقليل الألم والتوتر والقلق المرتبط بالإعاقة وصعوبة الحركة، سواء كان ذلك ناتجًا عن تشنجات عضلية أو ضغط على الأعصاب، مستخدمًا في ذلك تقنيات التدليك والتمارين للتخفيف من التوتر والألم.

تعزيز صحة الجسد بشكل عام:

يساعد العلاج الطبيعي على تحسين وظائف الجسم ورفع المناعة، ويقلل من خطر الإصابة بالأمراض المختلفة ويساعد على الحفاظ على الثقة بالنفس، ويعمل على تحسين نوعية حياة ذوي الإعاقة من خلال تعزيز الحركة والصحة العامة.

تحسين الوظائف الحيوية:

يهدف العلاج الطبيعي إلى تحسين قدرة الشخص على أداء الأنشطة الحيوية اليومية مثل الأكل والشرب والاستحمام بشكل مستقل.

تحسين القدرة على التواصل:

يمكن للعلاج الطبيعي أن يسهم في تحسين قدرة الشخص على التواصل والتفاعل مع الآخرين، سواء من خلال تحسين التواصل غير اللفظي أو تحسين قدرة الشخص على استخدام وسائل المساعدة التواصلية.

زيادة الاستقلالية:

يهدف العلاج الطبيعي إلى زيادة استقلالية المريض في أداء أنشطته اليومية وتحقيق أقصى درجات الاستقلالية الممكنة.

 

وسائل وطرق العلاج الطبيعي:

التمارين العلاجيّة هي عبارة عن حركات علاجيّة يتمّ إجراؤها على أساس علميّ ومخطّط له، بحيث يقوم به أخصائيّ العلاج الطبيعيّ حسب حالة الفرد وتبعاً لإصابته.

وتهدف هذه التمارين إلى استعادة الوظائف الطبيعيّة للجزء المصاب، أو الإبقاء على وضعها الحاليّ كما هو، أو العمل على زيادة كفاءته ليستجيب الجسم لها ويتفاعل معها حتّى يتمّ إعادة تأهيل الجزء المصاب.

 العلاج المائي

يتمّ إجراء التمارين العلاجية للفرد في بركة مائيّة بالتعاون مع معالج ذو خبرة واسعة والمتدّرب بشكل كاف على هذا النوع من العلاج، ويهدف إلى العمل على تسهيل تمارين مرونة الحركة ليعزّز من المقاومة أثناء تمارين التقوية لتسهيل النشاطات التي تتطلّب تحميل وزن الجسم على الأرض.

 تسهيل العلاج اليدويّ

تسهيل التمارين التي من شأنها زيادة قوّة جهازي الدوران والتنفس لضمان حصول المريض على الاسترخاء أثناء الجلسة العلاجيّة للتقليل من مخاطر الإصابة، أو إعادة الإصابة في برنامج التأهيل.

العلاج اليدويّ هنا يتمّ تشخيص وعلاج العديد من الأعراض المختلفة باستخدام اليدين بحيث يتمّ تحديد العضو المسؤول عن الألم أو المحدوديّة في هذا العضو، ويتمّ تقسيمه بحيث يتمّ التعامل معه بالتحريك أو معالجة الأنسجة الطريّة، وتحريك ومعالجة المفاصل.

 العلاج بالحرارة

        تعتبر من أكثر الوسائل المستخدمة وخاصّةً لدى المصابين بالشدّ العضلي، ويهدف إلى تسخين المنطقة المصابة، وزيادة التدفّق فيها وتخفيف الألم.

 العلاج بالبرودة

هنا يتمّ استخدام البرودة ودرجات الحرارة المنخفضة لعلاج الألم أو الشدّ أو الانتفاخ، لغاية تخفيف الألم، وعلاج الإصابات الحديثة والمزمنة، والمساعدة على الحركة، والتخلّص من الانتفاخ، والشد العضليّ.

 العلاج الكهربائيّ

يهدف هذا العلاج إلى تحسين الوظائف الحيوية، والتخفيف من الألم

والتورّم، والعمل على شفاء الجروح، وإعادة تأهيل العضلة.',

            ],
            [
                'title' => 'تعريف العلاج الوظيفي',
                'content' => ' العلاج الوظيفي

للعلاج الوظيفي أهمية كبيرة في تحسين جودة حياة ذوي الإعاقة، وزيادة قدرتهم على التواصل والتفاعل، وتطوير مهاراتهم لتحقيق أقصى استقلالية ممكنة في حياتهم.

ولذا يمكن إبراز أهم أهداف العلاج الوظيفي في الآتي:

 تعزيز القدرة على القيام بالأنشطة اليومية:

يهدف العلاج الوظيفي إلى تحسين قدرة الشخص على أداء الأنشطة الحيوية اليومية والحياتية مثل الاستحمام واللبس وتناول الطعام بشكل مستقل.

تطوير مهارات التنسيق والتوازن:

يساعد العلاج الوظيفي في تحسين قدرة الفرد على التوازن والتنسيق بين الحركات المختلفة، مما يسهم في تحسين قدرته على الحركة بشكل عام.

تعزيز مهارات التواصل والتفاعل:

يساعد العلاج الوظيفي في تحسين قدرة الشخص على التواصل والتفاعل مع الآخرين، سواء من خلال استخدام وسائل التواصل المختلفة أو تطوير مهارات التواصل غير اللفظي.

تعزيز القدرة على التعلم والاندماج في المجتمع:

يهدف العلاج الوظيفي إلى تحسين قدرة الشخص على التعلم وتطوير مهارات جديدة، مما يساعده في الاندماج بشكل أفضل في المجتمع.

تحسين الاستقلالية وجودة الحياة:

يسهم العلاج الوظيفي في زيادة استقلالية الشخص في أداء حياته اليومية وتحسين جودة حياته بشكل عام.',

            ],
            [
                'title' => 'تعريف النطق والتخاطب',
                'content' => 'النطق والتخاطب'
            ],
            [
                'title' => 'تعريف تحليل السلوك',
                'content' => 'تحليل السلوك التطبيقي

(ABA)

 

يعتبر تحليل السلوك التطبيقي من أنجح وأفضل الطرق والتدخلات واكثرها فاعلية وانتشارًا مع الاضطرابات السلوكية والنمائية.

ويمكن استخدام استراتيجيات تحليل السلوك التطبيقي لاكتساب سلوكيات ومهارات مرغوبة مثل: اللعب الوظيفي، مهارات التواصل، المهارات الاستقلالية والحياتية، المهارات الاكاديمية، المهارات اللغوية، المهارات الاجتماعية.

ويمكن استخدام الاستراتيجيات المنبثقة من علم تحليل السلوك التطبيقي لخفض سلوكيات النمطية مثل: ايذاء الذات، الهروب، البكاء والصراخ، العناد.

 

أهمية تحليل السلوك التطبيقي:

تحليل السلوك التطبيقي ABA هو فهم وتغيير السلوك البشري بطريقة علمية وفعالة، وإليك بعض الأسباب التي تجعله أداة قيمة وهامة:

فهم السلوك: يساعد تحليل السلوك التطبيقي ABA على فهم السلوك البشري من خلال دراسة تأثير البيئة على هذا السلوك وتحديد العوامل المؤثرة فيه.
تحديد الأهداف: يساعد تحليل السلوك التطبيقي ABA على تحديد أهداف محددة وقابلة للقياس لتغيير السلوك بطريقة مستهدفة وفعالة.
تصميم برامج فعالة: يتيح تحليل السلوك التطبيقي ABA تصميم برامج تدريبية وتعليمية فعالة تستند إلى مبادئ علمية لتعزيز السلوك الإيجابي وتقليل السلوك السلبي.
تقديم الدعم والتدريب: يوفر تحليل السلوك التطبيقي ABA إطارًا لتقديم الدعم والتدريب المستمر للأفراد لتعزيز سلوكياتهم المرغوبة وتقليل سلوكياتهم غير المرغوبة.
قاعدة علمية: يعتمد تحليل السلوك التطبيقي ABA على أسس علمية قوية وأبحاث موثقة، مما يجعله منهجًا موثوقًا وفعالاً في تغيير السلوك، وتحسين جودة حياة الأفراد، وزيادة فرص نجاحهم في مختلف المجالات.
تحسين وزيادة السلوكيات المرغوبة: يستهدف ABA تحسين وزيادة السلوكيات المرغوبة للأشخاص، مثل تعلم المهارات الاجتماعية أو القراءة، ويمكن أن يكون ذلك مفيدًا للأفراد الذين يحتاجون إلى تطوير مهارات معينة.
تقليل السلوكيات غير المرغوبة: يمكن استخدام ABA للتعامل مع سلوكيات غير مقبولة اجتماعيًا أو مشكلات سلوكية شديدة؛ حيث يساعد في تقليل هذه السلوكيات من خلال تطبيق إجراءات محددة.
تحسين الانتباه والتركيز: يمكن أن يساعد ABA في تحسين الانتباه والتركيز، مما يؤدي إلى تحسين الأداء الأكاديمي والاجتماعي.
تدريب المهارات الحياتية اليومية: يمكن استخدام ABA لتعليم المهارات الحياتية الأساسية، مثل استخدام دورة المياه أو تناول الطعام بشكل منظم.'
            ]
        ];

        foreach ($blogs as $blog) {
            Blog::firstOrCreate($blog);
        }
    }
}
