<?php

use Spatie\LaravelSettings\Migrations\SettingsMigration;

return new class extends SettingsMigration
{
    public function up(): void
    {
        $this->migrator->add('blog.about_us', '
        من نحن

مركز التميز الشامل للتأهيل هو مركز طبي متخصص، يقدم خدمات عالية الجودة وفق معايير مهنية عالمية وأسس حديثة في مجال التأهيل الطبي للأطفال على وجه الخصوص ولغيرهم على وجه العموم، ويعتبر المركز مكانًا متخصصًا لتقديم الرعاية الصحية المتكاملة في مجال خدمات العلاج الطبيعي والعلاج الوظيفي وعلاج أمراض النطق والتخاطب، وبرامج تحليل السلوك التطبيقي (ِABA).


رؤيتنا
نسعى إلى أن نكون رائدين في تقديم خدمات تأهيل طبي متميزة في مجال الخدمات المساندة محليًا ودوليًا من خلال التميز في الرعاية الطبية ذات الأثر والابتكار والتطور المستمر.


رسالتنا
تقديم رعاية صحية متخصصة للأفراد المعاقين بما يضمن تحقيق أفضل نتائج علاجية لهم وتحسين جودة حياتهم.


قيمنا
الجودة والتميز: نسعى دائما إلى تحقيق أعلى مستويات الجودة في خدماتنا الطبية من خلال فريق عمل متخصص.
الشفافية والمصداقية: نحافظ على الوضوح والصراحة في جميع تعاملاتنا مع المرضى وذويهم وأن تكون كل التفاصيل واضحة لهم.
التعاون والعمل الجماعي: نحافظ على التعاون والعمل بروح الفريق مع المرضى وأسرهم من خلال فريق عمل متميز.


أهدافنا
تحقيق التنمية الكاملة للمعاقين من الأطفال وغيرهم بما يتناسب مع قدراتهم وإمكانياتهم.
تمكين المعاق من الاندماج داخل المجتمع والتقليل من الآثار السلبية للإعاقة.
تحديث البرامج التأهيلية وتطوير أساليب وادوات التشخيص واستخدام التقنيات الحديثة.
إرشاد وتوعية وتدريب الأسرة على كيفية التعامل الأمثل مع المعاقين.
دعم وتعزيز الشراكات الاجتماعية.
تحقيق الأداء الفعال واستمرارية الدافعية والولاء لدي العاملين.
التوسع والانتشار في الخدمات المقدمة على أوسع نطاق.

فريق عملنا
يفتخر مركز التميز الشامل للتأهيل باستقطاب أفضل الكفاءات من الأخصائيين في مختلف التخصصات الرئيسية والفرعية في مجال التأهيل الطبي مثل العلاج الطبيعي، والعلاج الوظيفي، وعلاج أمراض النطق والتخاطب، وتحليل السلوك التطبيقي ABA وذلك لتقديم أفضل خدمات الرعاية الطبية.


خدماتنا
خدمات العلاج الطبيعي..
خدمات العلاج الوظيفي.
خدمات علاج أمراض النطق والتخاطب.
تحليل السلوك التطبيقي ABA
        ');
    }
};
